{
  "description": "Soy un desarrollador full-stack con experiencia en la creación de aplicaciones web utilizando tecnologías modernas.",
  "resume": {
    "action": "Resumen",
    "description": "Ver currículum completo"
  },
  "about": {
    "action": "Acerca de",
    "description": "En 2019, decidí probar suerte en la creación de aplicaciones web y me sumergí en el mundo de la programación y el desarrollo web. Actualmente, he tenido el privilegio de desarrollar software para diferentes clientes. Mi principal objetivo es crear interfaces de usuario accesibles aprovechando al máximo las tecnologías modernas. Lo que más disfruto es crear software que se encuentra en la intersección del diseño y la ingeniería: cosas que se ven bien, pero que también están bien hechas. En mi tiempo libre, también me gusta explorar el mundo del servidor, combinando interfaces atractivas con las mejores prácticas en la gestión de datos. Cuando no estoy frente al ordenador, disfruto leyendo, pasando tiempo con mi esposa o corriendo por la playa."
  },
  "experience": {
    "action": "Experiencia",
    "items": [
      {
        "title": "Intehbel: Dejemos de soñar y hagámoslo realidad.",
        "date": "2023 - presente",
        "description": "Desarrollo de los componentes utilizados para construir la interfaz de usuario de la plataforma. Colaborar estrechamente con equipos multifuncionales, incluyendo desarrolladores y diseñadores.",
        "tags": ["Laravel", "JavaScript", "HTML", "CSS", "GitLab", "Trello"],
        "link": "https://intehbel.com/home"
      },
      {
        "title": "DSpot: Una empresa digital.",
        "date": "2022 - 2023",
        "description": "Desarrollo de los componentes utilizados para construir la interfaz de usuario de la plataforma. Colaborar estrechamente con equipos multifuncionales, incluyendo desarrolladores y diseñadores.",
        "tags": [
          "React",
          "TypeScript",
          "HTML",
          "CSS",
          "Storybook",
          "GitLab",
          "Trello"
        ],
        "link": "https://www.dspot.com.pl"
      },
      {
        "title": "Remake: Versiones de vídeo y localización de contenidos.",
        "date": "2021 - 2022",
        "description": "Desarrollo API con Node.js para integrar interfaces de usuario con diferentes servicios. Gestionar los servicios responsables de la creación y actualización de proyectos de Adobe PS y Adobe AE, así como de la renderización de proyectos de Adobe AE. Colaborar estrechamente con equipos multifuncionales, incluyendo desarrolladores y diseñadores.",
        "tags": [
          "Node.js",
          "Express.js",
          "Adobe Ps",
          "Adobe Ae",
          "GitLab",
          "Trello"
        ],
        "link": "https://remake.video"
      },
      {
        "title": "Findr: La plataforma de encuentro empresarial para tomadores de decisiones.",
        "date": "2021 - 2022",
        "description": "Desarrollo API con Nest.js. Desarrollo y mantener los componentes críticos utilizados para construir la interfaz de usuario de la plataforma. Colaborar estrechamente con equipos multidisciplinares, incluyendo desarrolladores, diseñadores y gerentes de producto, para implementar y promover las mejores prácticas en accesibilidad web.",
        "tags": [
          "Nest.js",
          "TypeScript",
          "AWS DynamoDB",
          "AWS Lambda",
          "Strapi",
          "Stripe",
          "Sendgrid",
          "Docker",
          "React",
          "HTML",
          "CSS",
          "GitLab",
          "Trello"
        ],
        "link": "https://findr.global"
      }
    ]
  },
  "cv": {
    "description": "Ingeniero de Software centrado en la creación de experiencias digitales atractivas y accesibles.",
    "experience": {
      "description": "Experiencia Relevante",
      "senior": "Ingeniero experimentado <i>2022 - Presente</i>",
      "engineer": "Ingeniero <i>2020 - 2022</i>",
      "general": [
        "Me especializo en la construcción, el diseño visual y el despliegue de sitios web de alto rendimiento, sistemas de diseño escalables y experiencias digitales compatibles con múltiples plataformas, utilizando herramientas modernas como JavaScript, TypeScript, React, CSS y tecnologías relacionadas.",
        "Colaboro con product managers, diseñadores e ingenieros para convertir ideas creativas en soluciones digitales concretas, trabajando en iteraciones ágiles de dos semanas.",
        "Lidero iniciativas en el equipo de ingeniería colaborando estrechamente, creando herramientas que optimizan la experiencia de desarrollo y guiando a otros mediante mentoría."
      ],
      "details": [
        "<span>Findr <i>2019 - 2021</i></span><ul><li>Desarrollé, mantuve y desplegué código en producción usando principalmente HTML, CSS, Sass y JavaScript.</li><li>Realicé pruebas de aseguramiento de calidad para garantizar compatibilidad entre navegadores y respuesta en dispositivos móviles.</li><li>Realicé pruebas end-to-end en los sitios para asegurar el funcionamiento adecuado de las vistas.</li></ul>",
        "<span>Remake <i>2021 - 2022</i></span><ul><li>Desarrollé, mantuve y desplegué código en producción usano principalmente JavaScript, Express, Adobe Ps, Adobe Ae.</li><li>Realicé pruebas unitarias en el backend para asegurar el correcto funcionamiento de los diferentes servicios.</li><li>Contribuí extensamente a la creación del SDK de la aplicación.</li></ul>",
        "<span>DSpot <i>2022 - 2023</i></span><ul><li>Desarrollé, mantuve y desplegué código en producción usando principalmente React, TypeScript, HTML y CSS.</li><li>Realicé pruebas de aseguramiento de calidad para garantizar compatibilidad entre navegadores y respuesta en dispositivos móviles.</li><li>Implementé historias con Storybook para garantizar el diseño de cada componente.</li></ul>",
        "<span>Intehbel <i>2023 - 2024</i></span><ul><li>Desarrollé, mantuve y desplegué código en producción usando principalmente Laravel, PHP, HTML, CSS y JavaScript.</li></ul>",
        "<span>Dabl <i>2024 - Presente</i></span><ul><li>Desarrollé, mantuve y desplegué código en producción usando TypeScript.</li><li>Desarrollé un driver para la comunicación entre el navegador y equipos médicos.</li></ul>"
      ]
    },
    "skills": "<h1>Habilidades</h1><h3>Lenguajes</h3><p>JavaScript (ES2015+), TypeScript, HTML, CSS, Sass, PHP, Dart</p><h3>Librerías y Frameworks</h3><p>React, Next.js, Node.js, Nest.js, Express.js, Flutter, Laravel,Tailwind CSS</p><h3>Herramientas y Plataformas</h3><p>Git, GitLab, GitHub, Storybook, Docker, Webpack, Strapi, Stripe,Zoom</p><h3>Bases de Datos</h3><p>MongoDB, MySQL, DynamoDB, SQL, PostgreSQL</p>",
    "education": "<h1>Educación</h1><h3>Universidad de Ciencias Informáticas</h3><p>Ingeniero en Ciencias de la Computación e Ingeniero de Software</p>",
    "languages": "<h1>Idiomas</h1><h3>Español</h3><p>Lengua materna</p><h3>Inglés</h3><p>B1</p>",
    "interest": "<h1>Intereses</h1><p>Tecnologías web, Baloncesto, Béisbol, ciencia ficción y fantasía,series: Breaking Bad y Game of Thrones.</p>"
  }
}
